app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT  "artists".* FROM "artists" WHERE (abc) LIMIT 1
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      @songs = Artist.find_by(id: params[:artist_id]).songs
      if @songs.nil?
        redirect_to artists_path, alert: "Artist not found."
      end
    else
      @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 5], ["id", 7]]
---
  def show
    if params[:artist_id]
      @song = Artist.find_by(id: params[:artist_id])
      if @song.nil?
        redirect_to artist_songs_path(@artist)
        flash[:alert] =  "Artist not found."
      end
    else
      @song = Song.find(params[:id])